Qitm2333/OP-Embedded-Studio/tools/embedded-display/sdkconfig.defaults
# Default standalone build profile: QS130TAB1005A 240x240 ST7789.
#
# Automated profile builds should combine:
#   screen_profiles/base.defaults
# with one screen-specific defaults file from screen_profiles/.
CONFIG_EXAMPLE_LCD_CONTROLLER_ST7789=y
CONFIG_EXAMPLE_LCD_PIXEL_CLOCK_HZ=10000000
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_EXAMPLE_PIN_NUM_SCLK=12
CONFIG_EXAMPLE_PIN_NUM_MOSI=11
CONFIG_EXAMPLE_PIN_NUM_MISO=-1
CONFIG_EXAMPLE_PIN_NUM_LCD_DC=9
CONFIG_EXAMPLE_PIN_NUM_LCD_RST=14
CONFIG_EXAMPLE_PIN_NUM_LCD_CS=10
CONFIG_EXAMPLE_PIN_NUM_BK_LIGHT=-1
CONFIG_EXAMPLE_LCD_BK_LIGHT_ON_LEVEL=1
CONFIG_EXAMPLE_LCD_H_RES=240
CONFIG_EXAMPLE_LCD_V_RES=240
CONFIG_EXAMPLE_LCD_X_GAP=0
CONFIG_EXAMPLE_LCD_Y_GAP=0
CONFIG_EXAMPLE_LCD_INVERT_COLOR=y
CONFIG_EXAMPLE_LCD_RGB_ORDER_RGB=y
